zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/pic32cx2051bz62132.h
/*
 * Header file for PIC32CX2051BZ62132
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* File generated from device description file (ATDF) version 2026-06-04T09:25:23Z */
#ifndef _PIC32CX2051BZ62132_H_
#define _PIC32CX2051BZ62132_H_

/* Header version uses Semantic Versioning 2.0.0 (https://semver.org/) */
#define HEADER_FORMAT_VERSION "3.0.0"

#define HEADER_FORMAT_VERSION_MAJOR (3)
#define HEADER_FORMAT_VERSION_MINOR (0)
#define HEADER_FORMAT_VERSION_PATCH (0)

/* PIC32CX2051BZ62132 definitions
  This file defines all structures and symbols for PIC32CX2051BZ62132:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  include <stdint.h>
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !defined(SKIP_INTEGER_LITERALS)
#  if defined(_UINT8_) || defined(_UINT16_) || defined(_UINT32_)
#    error "Integer constant value macros already defined elsewhere"
#  endif

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Macros that deal with sizes of integer constants for C/C++ */
#  define _UINT8_(x)   ((uint8_t)(x))    /* C code: 8-bits unsigned integer constant value */
#  define _UINT16_(x)  ((uint16_t)(x))   /* C code: 16-bits unsigned integer constant value */
#  define _UINT32_(x)  ((uint32_t)(x))   /* C code: 32-bits unsigned integer constant value */

#else /* Assembler */

#  define _UINT8_(x) (x)    /* Assembler: 8-bits unsigned integer constant value */
#  define _UINT16_(x) (x)   /* Assembler: 16-bits unsigned integer constant value */
#  define _UINT32_(x) (x)   /* Assembler: 32-bits unsigned integer constant value */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* SKIP_INTEGER_LITERALS */

/* ************************************************************************** */
/*                  CMSIS DEFINITIONS FOR PIC32CX2051BZ62132                  */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M4 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /* -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn       = -14, /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn            = -13, /* -13 Hard Fault, all classes of Fault    */
  MemoryManagement_IRQn     = -12, /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  BusFault_IRQn             = -11, /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn           = -10, /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  SVCall_IRQn               =  -5, /* -5  System Service Call via SVC instruction */
  DebugMonitor_IRQn         =  -4, /* -4  Debug Monitor                       */
  PendSV_IRQn               =  -2, /* -2  Pendable request for system service */
  SysTick_IRQn              =  -1, /* -1  System Tick Timer                   */

/* ************* PIC32CX2051BZ62132 specific Interrupt Numbers ************** */
  RTC_IRQn                  =   0, /* 0   Real-Time Counter (RTC)             */
  EIC_IRQn                  =   1, /* 1   External Interrupt Controller (EIC) */
  FREQM_IRQn                =   2, /* 2   Frequency Meter (FREQM)             */
  NVM_IRQn                  =   3, /* 3   flash controller (NVM)              */
  CHANGE_NOTICE_A_IRQn      =   4, /* 4   GPIO (GPIOA)                        */
  CHANGE_NOTICE_B_IRQn      =   5, /* 5   GPIO (GPIOB)                        */
  CHANGE_NOTICE_C_IRQn      =   6, /* 6   GPIO (GPIOC)                        */
  CHANGE_NOTICE_D_IRQn      =   7, /* 7   GPIO (GPIOD)                        */
  CHANGE_NOTICE_E_IRQn      =   8, /* 8   GPIO (GPIOE)                        */
  DMAC_0_3_IRQn             =   9, /* 9   Direct Memory Access Controller (DMAC) */
  DMAC_4_15_IRQn            =  10, /* 10  Direct Memory Access Controller (DMAC) */
  EVSYS_0_3_IRQn            =  11, /* 11  Event System Interface (EVSYS)      */
  EVSYS_4_11_IRQn           =  12, /* 12  Event System Interface (EVSYS)      */
  PAC_IRQn                  =  13, /* 13  Peripheral Access Controller (PAC)  */
  RAMECC_IRQn               =  14, /* 14  RAM ECC (RAMECC)                    */
  SERCOM0_IRQn              =  15, /* 15  Serial Communication Interface (SERCOM0) */
  SERCOM1_IRQn              =  16, /* 16  Serial Communication Interface (SERCOM1) */
  SERCOM2_IRQn              =  17, /* 17  Serial Communication Interface (SERCOM2) */
  SERCOM3_IRQn              =  18, /* 18  Serial Communication Interface (SERCOM3) */
  SERCOM4_IRQn              =  19, /* 19  Serial Communication Interface (SERCOM4) */
  SERCOM5_IRQn              =  20, /* 20  Serial Communication Interface (SERCOM5) */
  SERCOM6_IRQn              =  21, /* 21  Serial Communication Interface (SERCOM6) */
  TCC0_IRQn                 =  22, /* 22  Timer Counter Control (TCC0)        */
  TCC1_IRQn                 =  23, /* 23  Timer Counter Control (TCC1)        */
  TCC2_IRQn                 =  24, /* 24  Timer Counter Control (TCC2)        */
  TC0_IRQn                  =  25, /* 25  Basic Timer Counter (TC0)           */
  TC1_IRQn                  =  26, /* 26  Basic Timer Counter (TC1)           */
  TC2_IRQn                  =  27, /* 27  Basic Timer Counter (TC2)           */
  TC3_IRQn                  =  28, /* 28  Basic Timer Counter (TC3)           */
  TC4_IRQn                  =  29, /* 29  Basic Timer Counter (TC4)           */
  TC5_IRQn                  =  30, /* 30  Basic Timer Counter (TC5)           */
  TC6_IRQn                  =  31, /* 31  Basic Timer Counter (TC6)           */
  TC7_IRQn                  =  32, /* 32  Basic Timer Counter (TC7)           */
  TC8_IRQn                  =  33, /* 33  Basic Timer Counter (TC8)           */
  TC9_IRQn                  =  34, /* 34  Basic Timer Counter (TC9)           */
  ADCHS_IRQ_IRQn            =  35, /* 35  12-bit Analog to Digital Converter (ADCHS) */
  ADCHS_FAULT_IRQn          =  36, /* 36  12-bit Analog to Digital Converter (ADCHS) */
  ADCHS_FCC_IRQn            =  37, /* 37  12-bit Analog to Digital Converter (ADCHS) */
  ADCHS_BGVR_RDY_IRQn       =  38, /* 38  12-bit Analog to Digital Converter (ADCHS) */
  AC_IRQn                   =  39, /* 39  Analog Comparators (AC)             */
  CRYPTO_0_IRQn             =  40, /* 40   (CRYPTO)                           */
  CRYPTO_1_IRQn             =  41, /* 41   (CRYPTO)                           */
  QSPI_IRQn                 =  42, /* 42  Quad SPI interface (QSPI)           */
  ZB_INT0_IRQn              =  43, /* 43  ZigBee MAC DOS (ZIGBEE)             */
  BT_INT0_IRQn              =  44, /* 44  BLE (BLE)                           */
  BT_INT1_IRQn              =  45, /* 45  BLE (BLE)                           */
  ARBITER_IRQn              =  46, /* 46  Radio Arbiter (ARB)                 */
  CLKI_WAKEUP_NMI_IRQn      =  47, /* 47  BLE (BLE)                           */
  CVD_IRQn                  =  48, /* 48  Hardware CVD Controller Macro (CVD) */
  CRYPTO_2_IRQn             =  49, /* 49   (CRYPTO)                           */
  QEI_IRQn                  =  50, /* 50   (QEI)                              */
  CAN0_IRQn                 =  51, /* 51  Control Area Network (CAN0)         */
  CAN1_IRQn                 =  52, /* 52  Control Area Network (CAN1)         */
  ETH_IRQn                  =  53, /* 53  Ethernet Controller (ETH)           */
  USB_IRQn                  =  54, /* 54  USB (USB)                           */
  PLL_LOCK_BOOT_IRQn        =  55, /* 55  BT ZB Subsystem (BTZBSYS)           */
  PLL_LOCK_USER_IRQn        =  56, /* 56  BT ZB Subsystem (BTZBSYS)           */
  BT_LC_IRQn                =  57, /* 57  BLE (BLE)                           */

  PERIPH_MAX_IRQn           =  57  /* Max peripheral ID */
} IRQn_Type;
