zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cx_bz/bz62/include/pic32cx2051bz62132.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NMI_Handler                   ( void );
#ifndef __IAR_SYSTEMS_ICC__
void NonMaskableInt_Handler        ( void ) __attribute__((deprecated("Use NMI_Handler instead"))); /* The legacy name - kept for backward compatibility */
#else
void NonMaskableInt_Handler        ( void ); /* The legacy name - kept for backward compatibility */
#endif
void HardFault_Handler             ( void );
void MemManage_Handler             ( void );
#ifndef __IAR_SYSTEMS_ICC__
void MemoryManagement_Handler      ( void ) __attribute__((deprecated("Use MemManage_Handler instead"))); /* The legacy name - kept for backward compatibility */
#else
void MemoryManagement_Handler      ( void ); /* The legacy name - kept for backward compatibility */
#endif
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVC_Handler                   ( void );
#ifndef __IAR_SYSTEMS_ICC__
void SVCall_Handler                ( void ) __attribute__((deprecated("Use SVC_Handler instead"))); /* The legacy name - kept for backward compatibility */
#else
void SVCall_Handler                ( void ); /* The legacy name - kept for backward compatibility */
#endif
void DebugMon_Handler              ( void );
#ifndef __IAR_SYSTEMS_ICC__
void DebugMonitor_Handler          ( void ) __attribute__((deprecated("Use DebugMon_Handler instead"))); /* The legacy name - kept for backward compatibility */
#else
void DebugMonitor_Handler          ( void ); /* The legacy name - kept for backward compatibility */
#endif
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void FREQM_Handler                 ( void );
void NVM_Handler                   ( void );
void CHANGE_NOTICE_A_Handler       ( void );
void CHANGE_NOTICE_B_Handler       ( void );
void CHANGE_NOTICE_C_Handler       ( void );
void CHANGE_NOTICE_D_Handler       ( void );
void CHANGE_NOTICE_E_Handler       ( void );
void DMAC_0_3_Handler              ( void );
void DMAC_4_15_Handler             ( void );
void EVSYS_0_3_Handler             ( void );
void EVSYS_4_11_Handler            ( void );
void PAC_Handler                   ( void );
void RAMECC_Handler                ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void SERCOM2_Handler               ( void );
void SERCOM3_Handler               ( void );
void SERCOM4_Handler               ( void );
void SERCOM5_Handler               ( void );
void SERCOM6_Handler               ( void );
void TCC0_Handler                  ( void );
void TCC1_Handler                  ( void );
void TCC2_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void TC4_Handler                   ( void );
void TC5_Handler                   ( void );
void TC6_Handler                   ( void );
void TC7_Handler                   ( void );
void TC8_Handler                   ( void );
void TC9_Handler                   ( void );
void ADCHS_IRQ_Handler             ( void );
void ADCHS_FAULT_Handler           ( void );
void ADCHS_FCC_Handler             ( void );
void ADCHS_BGVR_RDY_Handler        ( void );
void AC_Handler                    ( void );
void CRYPTO_0_Handler              ( void );
void CRYPTO_1_Handler              ( void );
void QSPI_Handler                  ( void );
void ZB_INT0_Handler               ( void );
void BT_INT0_Handler               ( void );
void BT_INT1_Handler               ( void );
void ARBITER_Handler               ( void );
void CLKI_WAKEUP_NMI_Handler       ( void );
void CVD_Handler                   ( void );
void CRYPTO_2_Handler              ( void );
void QEI_Handler                   ( void );
void CAN0_Handler                  ( void );
void CAN1_Handler                  ( void );
void ETH_Handler                   ( void );
void USB_Handler                   ( void );
void PLL_LOCK_BOOT_Handler         ( void );
void PLL_LOCK_USER_Handler         ( void );
void BT_LC_Handler                 ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M4 Processor and Core Peripherals */
#define __ARCH_ARM                         1 /* None                                                                      */
#define __CM4_REV                     0x0001 /* None                                                                      */
#define __DEBUG_LVL                        3 /* None                                                                      */
#define __FPU_PRESENT                      1 /* None                                                                      */
#define __MPU_PRESENT                      1 /* None                                                                      */
#define __NVIC_PRIO_BITS                   3 /* None                                                                      */
#define __TRACE_LVL                        2 /* None                                                                      */
#define __VTOR_PRESENT                     1 /* None                                                                      */
#define __ARCH_ARM_CORTEX_M                1

/* CMSIS includes */
#if !defined(DISABLE_CMSIS)
#include "core_cm4.h"
#if !defined(DISABLE_CMSIS_INIT)
#include "system_pic32cx2051bz62132.h"
#endif /* DISABLE_CMSIS_INIT */
#endif /* DISABLE_CMSIS */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CX2051BZ62132         */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adchs.h"
#include "component/arb.h"
#include "component/ble.h"
#include "component/btzbsys.h"
#include "component/can.h"
#include "component/ccl.h"
#include "component/cfg.h"
#include "component/cmcc.h"
#include "component/cru.h"
#include "component/crypto.h"
#include "component/cvd.h"
#include "component/dac_ctrl.h"
#include "component/dmac.h"
#include "component/dmt.h"
#include "component/dscon.h"
#include "component/dsu.h"
#include "component/efuse.h"
#include "component/eic.h"
#include "component/eth.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gpio.h"
#include "component/hmatrix2top.h"
#include "component/nvm.h"
#include "component/pac.h"
#include "component/pche.h"
#include "component/pfw.h"
#include "component/pmu.h"
#include "component/pps.h"
#include "component/qei.h"
#include "component/qspi.h"
#include "component/ramecc.h"
#include "component/rcon.h"
#include "component/rot.h"
#include "component/rtc.h"
#include "component/sercom.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/usb.h"
#include "component/wdt.h"
#include "component/zigbee.h"

/* ************************************************************************** */
/*                INSTANCE DEFINITIONS FOR PIC32CX2051BZ62132                 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adchs.h"
#include "instance/arb.h"
#include "instance/ble.h"
#include "instance/btzbsys.h"
#include "instance/can0.h"
#include "instance/can1.h"
#include "instance/ccl.h"
#include "instance/cfg.h"
#include "instance/cmcc.h"
#include "instance/cru.h"
#include "instance/crypto.h"
#include "instance/cvd.h"
#include "instance/dac_ctrl.h"
#include "instance/dmac.h"
#include "instance/dmt.h"
#include "instance/dscon.h"
#include "instance/dsu.h"
#include "instance/efuse.h"
#include "instance/eic.h"
#include "instance/eth.h"
#include "instance/evsys.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gpioa.h"
#include "instance/gpiob.h"
#include "instance/gpioc.h"
#include "instance/gpiod.h"
#include "instance/gpioe.h"
#include "instance/hmatrix2top.h"
#include "instance/nvm.h"
#include "instance/pac.h"
#include "instance/pche.h"
#include "instance/pfw.h"
#include "instance/pmu.h"
#include "instance/pps.h"
#include "instance/qei.h"
#include "instance/qspi.h"
#include "instance/ramecc.h"
#include "instance/rcon.h"
#include "instance/rot.h"
#include "instance/rtc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/sercom4.h"
#include "instance/sercom5.h"
#include "instance/sercom6.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tc5.h"
#include "instance/tc6.h"
#include "instance/tc7.h"
#include "instance/tc8.h"
#include "instance/tc9.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/usb.h"
#include "instance/wdt.h"
#include "instance/zigbee.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CX2051BZ62132              */
/* ************************************************************************** */
#define ID_PAC           (  0) /* Instance index for PAC (PAC) */
#define ID_FREQM         (  1) /* Instance index for FREQM (FREQM) */
#define ID_EIC           (  2) /* Instance index for EIC (EIC) */
#define ID_SERCOM0       (  3) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       (  4) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_TC0           (  5) /* Instance index for TC0 (TC0) */
#define ID_TC1           (  6) /* Instance index for TC1 (TC1) */
#define ID_TC2           (  7) /* Instance index for TC2 (TC2) */
#define ID_TC3           (  8) /* Instance index for TC3 (TC3) */
#define ID_TC4           (  9) /* Instance index for TC4 (TC4) */
#define ID_TC5           ( 10) /* Instance index for TC5 (TC5) */
#define ID_TC6           ( 11) /* Instance index for TC6 (TC6) */
#define ID_TC7           ( 12) /* Instance index for TC7 (TC7) */
#define ID_TCC0          ( 13) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 14) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 15) /* Instance index for TCC2 (TCC2) */
#define ID_DSU           ( 32) /* Instance index for DSU (DSU) */
#define ID_DMAC          ( 34) /* Instance index for DMAC (DMAC) */
#define ID_EVSYS         ( 35) /* Instance index for EVSYS (EVSYS) */
#define ID_RAMECC        ( 36) /* Instance index for RAMECC (RAMECC) */
#define ID_QSPI          ( 64) /* Instance index for QSPI (QSPI) */
#define ID_SERCOM6       ( 65) /* Instance index for SERCOM6 (SERCOM6) */
#define ID_CCL           ( 70) /* Instance index for CCL (CCL) */
#define ID_AC            ( 71) /* Instance index for AC (AC) */
#define ID_HMATRIX2TOP   ( 73) /* Instance index for HMATRIX2TOP (HMATRIX2TOP) */
#define ID_SERCOM2       ( 96) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 97) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_SERCOM4       ( 98) /* Instance index for SERCOM4 (SERCOM4) */
#define ID_SERCOM5       ( 99) /* Instance index for SERCOM5 (SERCOM5) */
#define ID_TC8           (100) /* Instance index for TC8 (TC8) */
#define ID_TC9           (101) /* Instance index for TC9 (TC9) */
#define ID_CAN0          (104) /* Instance index for CAN0 (CAN0) */
#define ID_CAN1          (105) /* Instance index for CAN1 (CAN1) */

#define ID_PERIPH_MAX    (105) /* Number of peripheral IDs */

/* ************************************************************************** */
/*       REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX2051BZ62132        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42001c00)                 /* AC Registers Address         */
#define ADCHS_REGS                       ((adchs_registers_t*)0x44001500)              /* ADCHS Registers Address      */
#define ARB_REGS                         ((arb_registers_t*)0x41011000)                /* ARB Registers Address        */
#define BLE_REGS                         ((ble_registers_t*)0x41012000)                /* BLE Registers Address        */
#define BTZBSYS_REGS                     ((btzbsys_registers_t*)0x41014000)            /* BTZBSYS Registers Address    */
#define CAN0_REGS                        ((can_registers_t*)0x46002000)                /* CAN0 Registers Address       */
#define CAN1_REGS                        ((can_registers_t*)0x46002400)                /* CAN1 Registers Address       */
#define CCL_REGS                         ((ccl_registers_t*)0x42001800)                /* CCL Registers Address        */
#define CFG_REGS                         ((cfg_registers_t*)0x44000000)                /* CFG Registers Address        */
#define CMCC_REGS                        ((cmcc_registers_t*)0x41002000)               /* CMCC Registers Address       */
#define CRU_REGS                         ((cru_registers_t*)0x44000a00)                /* CRU Registers Address        */
#define CVD_REGS                         ((cvd_registers_t*)0x44002400)                /* CVD Registers Address        */
#define DAC_CTRL_REGS                    ((dac_ctrl_registers_t*)0x44002e00)           /* DAC_CTRL Registers Address   */
#define DMAC_REGS                        ((dmac_registers_t*)0x41004000)               /* DMAC Registers Address       */
#define DMT_REGS                         ((dmt_registers_t*)0x44000e00)                /* DMT Registers Address        */
#define DSCON_REGS                       ((dscon_registers_t*)0x42011000)              /* DSCON Registers Address      */
#define DSU_REGS                         ((dsu_registers_t*)0x41000000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40000800)                /* EIC Registers Address        */
#define EFUSE_REGS                       ((efuse_registers_t*)0x00000000)              /* EFUSE Registers Address      */
#define ETH_REGS                         ((eth_registers_t*)0x4100a000)                /* ETH Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x41006000)              /* EVSYS Registers Address      */
#define FREQM_REGS                       ((freqm_registers_t*)0x40000400)              /* FREQM Registers Address      */
#define FUSES_DEVICECFG_REGS             ((fuses_devicecfg_registers_t*)0x00810e80)    /* FUSES Registers Address      */
#define GPIOE_REGS                       ((gpio_registers_t*)0x44002d00)               /* GPIOE Registers Address      */
#define GPIOD_REGS                       ((gpio_registers_t*)0x44002c00)               /* GPIOD Registers Address      */
#define GPIOC_REGS                       ((gpio_registers_t*)0x44002b00)               /* GPIOC Registers Address      */
#define GPIOB_REGS                       ((gpio_registers_t*)0x44002a00)               /* GPIOB Registers Address      */
#define GPIOA_REGS                       ((gpio_registers_t*)0x44002900)               /* GPIOA Registers Address      */
#define HMATRIX2TOP_REGS                 ((hmatrix2top_registers_t*)0x42002400)        /* HMATRIX2TOP Registers Address */
#define NVM_REGS                         ((nvm_registers_t*)0x44000600)                /* NVM Registers Address        */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /* PAC Registers Address        */
#define PCHE_REGS                        ((pche_registers_t*)0x44012400)               /* PCHE Registers Address       */
#define PFW_REGS                         ((pfw_registers_t*)0x44000800)                /* PFW Registers Address        */
#define PMU_REGS                         ((pmu_registers_t*)0x44013e00)                /* PMU Registers Address        */
#define PPS_REGS                         ((pps_registers_t*)0x44001000)                /* PPS Registers Address        */
#define QEI_REGS                         ((qei_registers_t*)0x44005000)                /* QEI Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x42000000)               /* QSPI Registers Address       */
#define RAMECC_REGS                      ((ramecc_registers_t*)0x41008000)             /* RAMECC Registers Address     */
#define RCON_REGS                        ((rcon_registers_t*)0x44000a00)               /* RCON Registers Address       */
#define ROT_REGS                         ((rot_registers_t*)0x44003000)                /* ROT Registers Address        */
#define RTC_REGS                         ((rtc_registers_t*)0x42010000)                /* RTC Registers Address        */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x40000c00)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x40001000)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x46000000)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x46000400)             /* SERCOM3 Registers Address    */
#define SERCOM4_REGS                     ((sercom_registers_t*)0x46000800)             /* SERCOM4 Registers Address    */
#define SERCOM5_REGS                     ((sercom_registers_t*)0x46000c00)             /* SERCOM5 Registers Address    */
#define SERCOM6_REGS                     ((sercom_registers_t*)0x42000400)             /* SERCOM6 Registers Address    */
#define CRYPTO_REGS                      ((crypto_registers_t*)0x43000000)             /* CRYPTO Registers Address     */
#define TC0_REGS                         ((tc_registers_t*)0x40001400)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40001800)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40001c00)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x40002000)                 /* TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x40002400)                 /* TC4 Registers Address        */
#define TC5_REGS                         ((tc_registers_t*)0x40002800)                 /* TC5 Registers Address        */
#define TC6_REGS                         ((tc_registers_t*)0x40002c00)                 /* TC6 Registers Address        */
#define TC7_REGS                         ((tc_registers_t*)0x40003000)                 /* TC7 Registers Address        */
#define TC8_REGS                         ((tc_registers_t*)0x46001000)                 /* TC8 Registers Address        */
#define TC9_REGS                         ((tc_registers_t*)0x46001400)                 /* TC9 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x40003400)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x40003800)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x40003c00)                /* TCC2 Registers Address       */
#define USB_REGS                         ((usb_registers_t*)0x44010000)                /* USB Registers Address        */
#define WDT_REGS                         ((wdt_registers_t*)0x44000500)                /* WDT Registers Address        */
#define ZIGBEE_REGS                      ((zigbee_registers_t*)0x41010000)             /* ZIGBEE Registers Address     */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

